var questions = [ // база вопросов
	{
		name: "Перевод",
		fortest: 4,
		tasktext: "Выберите правильный перевод",
		data: [
			{
				question: "уҡымышлы",
				variants: [
					"толстый",
					"образованный",
					"талантливый"
				],
				answer: 1
			},
			{
				question: "байрам",
				variants: [
					"магазин",
					"айран",
					"праздник"
				],
				answer: 2
			},
			{
				question: "мәктәп",
				variants: [
					"хлеб",
					"школа",
					"лодка"
				],
				answer: 1
			},
			{
				question: "ямғыр",
				variants: [
					"дождь",
					"злой",
					"радуга"
				],
				answer: 0
			},
			{
				question: "ҡыҙыл",
				variants: [
					"горячий",
					"смешно",
					"красный"
				],
				answer: 2
			},
			{
				question: "ҡуян",
				variants: [
					"заяц",
					"проснись",
					"лиса"
				],
				answer: 0
			},
			{
				question: "ҡалаҡ",
				variants: [
					"вор",
					"ложка",
					"железо"
				],
				answer: 1
			}
		]
	},
	{
		name: "Грамматика",
		fortest: 4,
		tasktext: "Выбери правильное слово ",
		data: [
			{
				question: "Әйҙәгеҙ бергә ... ",
				variants: [
					"уйнайым",
					"уйнайыҡ",
					"уйнайһың"
				],
				answer: 1
			},
			{
				question: "Башҡортостан Рәсәйҙең- ... матур төбәге",
				variants: [
					"үтә",
					"иң",
				],
				answer: 1
			},
			{
				question: "Бөгөн класта Зөлфиә ... Айһылыу дежурныйҙар",
				variants: [
					"менән",
					"кеүек",
				],
				answer: 0
			},
			{
				question: "Ниңә ... һыуға төшкәндәй йөрөйһөң?",
				variants: [
					"биҙрәң",
					"балтаң",
				],
				answer: 1
			},
			{
				question: "Ирәндек китап ... ултыра",
				variants: [
					"уҡып",
					"уҡыясаҡ",
				],
				answer: 0
			},
			{
				question: "Беҙ өләсәйем менән икмәк ...",
				variants: [
					"бешерәм",
					"бешерәбеҙ",
				],
				answer: 1
			},
			{
				question: "Ут менән шаярырға ... , балалар!",
				variants: [
					"ярамай",
					"яраймы",
				],
				answer: 0
			},
			{
				question: "Салауат Юлаев батыр кеше ...",
				variants: [
					"булған",
					"буласаҡ",
				],
				answer: 0
			},
			{
				question: "Үткән йәй беҙ синыфыбыҙ менән Шүлгәндә ...",
				variants: [
					"булдыҡ",
					"булырбыҙ",
				],
				answer: 0
			},
			{
				question: "Киләһе йыл мин 9-сы синыфҡа ...",
				variants: [
					"булырбыҙ",
					"барасаҡмын",
				],
				answer: 1
			},
			{
				question: "Ете ҡат үлсә - бер ҡат ...",
				variants: [
					"эшлә",
					"киҫ",
				],
				answer: 1
			}
		]
	},
	{
		name: "Орфография",
		fortest: 4,
		tasktext: "Вставьте пропущенные буквы",
		data: [
			{
				question: "гөл.әмә",
				variants: [
					"л",
					"д",
					"не ставится"
				],
				answer: 0
			},
			{
				question: "тә.әрмәс",
				variants: [
					"г",
					"ғ",
					"м"
				],
				answer: 1
			},
			{
				question: ".герәм",
				variants: [
					"ю",
					"йү",
				],
				answer: 1
			},
			{
				question: "мине. телефон",
				variants: [
					"м",
					"ң",
					"н",
				],
				answer: 1
			},
			{
				question: "беҙ.ең йорт",
				variants: [
					"ҙ",
					"д",
					"не ставится"
				],
				answer: 0
			},
			{
				question: "һеҙҙең ҡыҙ.ығыҙ һылыу",
				variants: [
					"ҙ",
					"не ставится"
				],
				answer: 1
			},
		]
	},
		{
		name: "Слитно или раздельно",
		fortest: 4,
		tasktext: "Слитно или раздельно?",
		data: [
			{
				question: "МИН.ДӘ уҡырға барам",
				variants: [
					"слитно",
					"раздельно",
				],
				answer: 1
			},
			{
				question: "ҺЕҘ.ҘӘ алмағас бармы?",
				variants: [
					"слитно",
					"раздельно",
				],
				answer: 0
			},
			{
				question: "ҺИҢӘ.ЛӘ бишле билдәһе буласаҡ",
				variants: [
					"слитно",
					"раздельно",
				],
				answer: 1
			},
			{
				question: "БЕҘҘЕКЕЛӘР.ҘӘ еңәсәктәр!",
				variants: [
					"слитно",
					"раздельно",
				],
				answer: 1
			},
			{
				question: "МИН.ДӘ Әхмәттең телефон һандары бар",
				variants: [
					"слитно",
					"раздельно",
				],
				answer: 0
			},
		]
	},
];

var levels = [
	{
		min: 0,			//в процентах
		max: 30,
		level: 'Неудовлетворительно',
		descr: 'Вы очень старались... но много совершили ошибок... попробуйте еще раз'
	},
	{
		min: 31,
		max: 63,
		level: 'Удовлетворительно',
		descr: 'У Вас средний уровень. Но можно улучшить и попробовать снова пройти тест... '
	},
	{
		min: 64,
		max: 85,
		level: 'Хорошо',
		descr: 'Вы хорошо знаете башкирский язык. Но до "отлично" чуть-чуть не хватило('
	},
	{
		min: 86,
		max: 100,
		level: 'Отлично',
		descr: 'У Вас отличный башкирский язык, поздравляю!'
	}
];
