var questions = [ // база вопросов
	{
		name: "Перевод",
		fortest: 4,
		tasktext: "Выберите правильный перевод",
		data: [
			{
				question: "уҡымышлы",
				variants: [
					"толстый",
					"образованный",
					"талантливый"
				],
				answer: 1
			},
			{
				question: "байрам",
				variants: [
					"магазин",
					"айран",
					"праздник"
				],
				answer: 2
			},
			{
				question: "мәктәп",
				variants: [
					"хлеб",
					"школа",
					"лодка"
				],
				answer: 1
			},
			{
				question: "ямғыр",
				variants: [
					"дождь",
					"злой",
					"радуга"
				],
				answer: 0
			},
			{
				question: "ҡыҙыл",
				variants: [
					"горячий",
					"смешно",
					"красный"
				],
				answer: 2
			},
			{
				question: "ҡуян",
				variants: [
					"заяц",
					"проснись",
					"лиса"
				],
				answer: 0
			},
			{
				question: "ҡалаҡ",
				variants: [
					"вор",
					"ложка",
					"железо"
				],
				answer: 1
			}
			{
				question: "тау",
				variants: [
					"дорога",
					"камень",
					"гора"
				],
				answer: 2
			}
			{
				question: "китап",
				variants: [
					"тетрадь",
					"книга",
					"сумка"
				],
				answer: 1
			}
		]
	},
	{
		name: "Грамматика",
		fortest: 4,
		tasktext: "Выбери правильное слово ",
		data: [
			{
				question: "Әйҙәгеҙ бергә ... ",
				variants: [
					"уйнайым",
					"уйнайыҡ",
					"уйнайһың"
				],
				answer: 1
			},
			{
				question: "Башҡортостан Рәсәйҙең- ... матур төбәге",
				variants: [
					"үтә",
					"иң",
				],
				answer: 1
			},
			{
				question: "Бөгөн класта Зөлфиә ... Айһылыу дежурныйҙар",
				variants: [
					"менән",
					"кеүек",
				],
				answer: 0
			},
			{
				question: "Ниңә ... һыуға төшкәндәй йөрөйһөң?",
				variants: [
					"биҙрәң",
					"балтаң",
				],
				answer: 1
			},
			{
				question: "Гүзәлиә китап ... ултыра",
				variants: [
					"уҡып",
					"уҡыясаҡ",
				],
				answer: 0
			},
			{
				question: "Беҙ өләсәйем менән икмәк ...",
				variants: [
					"бешерәм",
					"бешерәбеҙ",
				],
				answer: 1
			},
			{
				question: "Ут менән шаярырға ... , балалар!",
				variants: [
					"ярамай",
					"яраймы",
				],
				answer: 0
			},
			{
				question: "Салауат Юлаев батыр кеше ...",
				variants: [
					"булған",
					"буласаҡ",
				],
				answer: 0
			},
			{
				question: "Үткән йәй беҙ синыфыбыҙ менән Шүлгәндә ...",
				variants: [
					"булдыҡ",
					"булырбыҙ",
				],
				answer: 0
			},
			{
				question: "Киләһе йыл мин 9-сы синыфҡа ...",
				variants: [
					"булырбыҙ",
					"барасаҡмын",
				],
				answer: 1
			},
			{
				question: "Ете ҡат үлсә - бер ҡат ...",
				variants: [
					"эшлә",
					"киҫ",
				],
				answer: 1
			}
		]
	},
	{
		name: "Орфография",
		fortest: 4,
		tasktext: "Вставьте пропущенные буквы",
		data: [
			{
				question: "гөл.әмә",
				variants: [
					"л",
					"д",
					"не ставится"
				],
				answer: 0
			},
			{
				question: "тә.әрмәс",
				variants: [
					"г",
					"ғ",
					"м"
				],
				answer: 0
			},
			{
				question: ".герәм",
				variants: [
					"ю",
					"йү",
				],
				answer: 1
			},
			{
				question: "мине. телефон",
				variants: [
					"м",
					"ң",
					"н",
				],
				answer: 1
			},
			{
				question: "беҙ.ең йорт",
				variants: [
					"ҙ",
					"д",
					"не ставится"
				],
				answer: 0
			},
			{
				question: "к.ҫә",
				variants: [
					"ә",
					"е",
					"не ставится"
				],
				answer: 1
			},
			{
				question: "һеҙҙең ҡыҙ.ығыҙ һылыу",
				variants: [
					"ҙ",
					"не ставится"
				],
				answer: 1
			},
		]
	},
		{
		name: "Слитно или раздельно",
		fortest: 4,
		tasktext: "Слитно или раздельно?",
		data: [
			{
				question: "МИН.ДӘ уҡырға барам",
				variants: [
					"слитно",
					"раздельно",
				],
				answer: 1
			},
			{
				question: "ҺЕҘ.ҘӘ алмағас бармы?",
				variants: [
					"слитно",
					"раздельно",
				],
				answer: 0
			},
			{
				question: "ҺИҢӘ.ЛӘ бишле билдәһе буласаҡ",
				variants: [
					"слитно",
					"раздельно",
				],
				answer: 1
			},
			{
				question: "БЕҘҘЕКЕЛӘР.ҘӘ еңәсәктәр!",
				variants: [
					"слитно",
					"раздельно",
				],
				answer: 1
			},
			{
				question: "МИН.ДӘ Әхмәттең телефон һандары бар",
				variants: [
					"слитно",
					"раздельно",
				],
				answer: 0
			},
		]
	},
	{
		name: "EГЭ",
		fortest: 4,
		tasktext: "Выберите правильный вариант",
		data: [
			{
				question: "Сколько букв на башкирском языке?",
				variants: [
					"43",
					"41",
					"44",
					"42",
				],
				answer: 3
			},
			{
				question: "Сколько гласных букв на башкирском языке?",
				variants: [
					"11",
					"9",
					"12",
					"8",
				],
				answer: 1
			},
			{
				question: "Ҡалын һуҙынҡыларҙы билдәләгеҙ:",
				variants: [
					"а, ы, о, ү",
					" ә, ы, о, у",
					"а, ы, о, у",
					"ә, ө, ы, ү",
				],
				answer: 2
			},
			{
				question: "Нәҙек һуҙынҡыларҙы билдәләгеҙ:",
				variants: [
					"ә, э (е), ө, ү, и  ",
					"ә, ы, о, у ",
					"ө, и, е, а ",
					"ә, ө, ы, ү",
				],
				answer: 0
			},
			{
				question: "Ниндәй, ҡайһы, ҡайҙағы, ҡасанғы һорауҙарына яуап биреп, предметтың билдәһен белдергән һүҙҙәр:       ",
				variants: [
					"омоним ",
					" исем ",
					"антоним",
					"сифат",
				],
				answer: 3
			},
			{
				question: "Предметтың иҫәбен, уның һаналыу тәртибен белдергән һүҙ:",
				variants: [
					"омоним",
					"исем",
					"һан",
					"сифат",
				],
				answer: 2
			},
			{
				question: "Ҡайһы  һүҙҙең  яҙылышы  дөрөҫ?",
				variants: [
					"көньяҡ",
					"Байъегет",
					"Гөльемеш",
					"Аҡъйегет",
				],
				answer: 0
			},
			{
				question: "Бер генә ижектән торған һүҙҙе билдәләгеҙ:",
				variants: [
					"алтынсы ",
					"етен",
					"ауыл",
					"класс",
				],
				answer: 3
			},
			{
				question: "Предмет, кеше, күренеш, төшөнсәләрҙең атамаһын аңлатҡан һүҙ төркөмө:",
				variants: [
					"ҡылым",
					"сифат",
					"рәүеш",
					"исем",
				],
				answer: 3
			},
			{
				question: "Китап һүҙенең төшөм килештәге формаһы:",
				variants: [
					"китапты",
					"китапҡа",
					"китапта",
					"китаптан",
				],
				answer: 0
			},
			{
				question: "Предметтың билдәһен аңлатҡан һүҙҙәр:",
				variants: [
					"исем ",
					"рәүеш ",
					"ҡылым ",
					"сифат ",
				],
				answer: 0
			},
			{
				question: "«Йәм-йәшел»…",
				variants: [
					"сағыштырыу дәрәжәһе  ",
					"артыҡлыҡ дәрәжәһе  ",
					"төп дәрәжә ",
					"аҙһытыу дәрәжәһе ",
				],
				answer: 1
			},
			{
				question: "Минең әйткәндәргә, зинһар, иғтибар итә күрегеҙ! Зинһар ниндәй һүҙ? ",
				variants: [
					"өндәш һүҙ",
					"инеш һүҙ",
					"өҫтәлмәлек",
					"ымлыҡ",
				],
				answer: 0
			},
			{
				question: "Төп башҡорт һүҙен табығыҙ:",
				variants: [
					"китап",
					"сабата  ",
					"япраҡ",
					"шәкәр",
				],
				answer: 2
			},
			{
				question: "Күп мәғәнәле һүҙҙәрҙе табығыҙ:",
				variants: [
					"оло",
					"сабата",
					"кислород ",
					"дүрт",
				],
				answer: 0
			},
			{
				question: "Һалам - һалам ул…",
				variants: [
					"синоним ",
					"антоним",
					"омоним ",
					"перифраз",
				],
				answer: 2
			},
			{
				question: "Башҡорттар нисәнсе йылда рус графикаһы нигеҙендә төҙөлгән алфавит менән ҡуллана башлай?",
				variants: [
					"1928 ",
					"1935",
					"1940 ",
					"1955",
				],
				answer: 2
			},
			{
				question: "Ашъяулыҡ һүҙендә нисә өн бар?",
				variants: [
					"8 ",
					"9",
					"4 ",
					"6",
				],
				answer: 0
			},
			{
				question: "Башҡорт телендә баҫым һүҙҙең ҡайһы өлөшөнә төшә?",
				variants: [
					"аҙағына ",
					"башына ",
					"уртаһына ",
					"уртаһына, башына",
				],
				answer: 0
			},
			{
				question: "Исем төбәү килештә ниндәй һорауға яуап бирә?",
				variants: [
					"Кем? Нимә?",
					"Кемгә? Нимәгә?",
					"Кемде? Нимәне?",
					"кемдән? Нимәнән?",
				],
				answer: 1
			},
			{
				question: "Уҡыуҙар тамамланыу менән, беҙ ҙә колхоз эшенә йөрөй башланыҡ. Эйәрсән һөйләм баш һөйләмгә нисек бәйләнеп килгән? ",
				variants: [
					"килеш ялғауы менән ",
					"хәл ҡылым ялғауы менән",
					"сифат ҡылым ялғауы менән ",
					"бәйләүестәр ярҙамында",
				],
				answer: 3
			},
			{
				question: "Телмәрҙең төп берәмеге:",
				variants: [
					"хәреф",
					"һүҙбәйләнеш",
					"һүҙ",
					"һөйләм",
				],
				answer: 3
			},
			{
				question: "Мин бер самауыр сәй эстем инде. Һөйләмдең төрө: ",
				variants: [
					"һорау һөйләм",
					"хәбәр һөйләм",
					"өндәү һөйләм",
					"бойороҡ һөйләм",
				],
				answer: 1
			},
			{
				question: "Барыһы ла уны йотлоғоп тыңлай. Һөйләмдең хәбәрен табып, уның төрөн билдәләгеҙ.",
				variants: [
					"ябай",
					"ҡушма",
					"яһалма",
				],
				answer: 0
			},
			{
				question: "Һөйләмдең эйәрсән киҫәктәре:",
				variants: [
					"исем, сифат, һан, алмаш",
					"аныҡлаусы, тултырыусы, хәл, өҫтәлмәлек",
					"эйә, хәбәр, тултырыусы, хәл",
					"тултырыусы, хәл, алмаш, һан",
				],
				answer: 2
			},
			{
				question: "Хәлдәр ниндәй һорауға яуап бирә?",
				variants: [
					"кем, нимә, кемдәр, нимәләр",
					"ҡасан, ҡайҙа, нисек, ни рәүешле",
					"ниндәй, ҡайһы, нисә, нисәнсе",
					"ни эшлә, нимә эшлә, ҡасан, ҡайҙа",
				],
				answer: 1
			},
			{
				question: "Һөйләмдә һүҙҙәрҙең урынлашыу тәртибе:",
				variants: [
					"эйә һөйләмдең башында, хәбәр - аҙағында",
					"Хәбәр һөйләмдең башында, эйә - аҙағында",
					"хәл, тултырыусы, аныҡлаусы, эйә",
					"Аныҡлаусы аныҡланыусының алдынан тора",
				],
				answer: 0
			},
			{
				question: "Һөйләмдәрҙә һорау һөйләмде табығыҙ:",
				variants: [
					"–Берәй ерең ауыртманымы, бөҙрә баш?",
					"Алты мөйөшлө,бейек болдорло йорт һалдырҙы Талип.",
					"Йөрәгенә әлегә тиклем һиҙелмәгән бәхет уты тоҡанды.",
					"Ошо уйҙарҙан уның түбәһе күккә тейҙе.",
				],
				answer: 0
			},
		]
	},
];

var levels = [
	{
		min: 0,			//в процентах
		max: 30,
		level: 'Неудовлетворительно',
		descr: 'Вы очень старались... но много совершили ошибок... попробуйте еще раз'
	},
	{
		min: 31,
		max: 50,
		level: 'Удовлетворительно',
		descr: 'У Вас средний уровень. Но можно улучшить и попробовать снова пройти тест... '
	},
	{
		min: 50,
		max: 75,
		level: 'Хорошо',
		descr: 'Вы хорошо знаете башкирский язык. Но до "отлично" чуть-чуть не хватило('
	},
	{
		min: 75,
		max: 100,
		level: 'Отлично',
		descr: 'У Вас отличный башкирский язык, поздравляю!'
	}
];
